app/views/therapies/_form.html.erb

SELECT "therapists".* FROM "therapists" ORDER BY "therapists"."name" ASC
SELECT "therapists".* FROM "therapists" INNER JOIN "therapies_therapists" ON "therapists"."id" = "therapies_therapists"."therapist_id" WHERE "therapies_therapists"."therapy_id" = ?  [["therapy_id", 1]]
---
    <%= hidden_field_tag("therapy[therapist_ids][]", nil) %>
    <% Therapist.order(:name).each do |therapist| %>
      <label><%= check_box_tag("therapy[therapist_ids][]", therapist.id, therapist.id.in?(@therapy.therapists.collect(&:id))) %> <%= therapist.name %></label>