app/views/therapies/_index.html.erb

SELECT  "therapies".* FROM "therapies" ORDER BY "therapies"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
<h1>Serviços</h1>
<% cache ['pages', Therapy.last] do %>