app/views/therapies/index.html.erb

SELECT  "therapies".* FROM "therapies" ORDER BY "therapies"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "therapies"
---
<h1>Serviços</h1>
<% cache ['pages', Therapy.last] do %>