app/controllers/administrators_controller.rb

SELECT "administrators".* FROM "administrators"
---
  def index
    @administrators = Administrator.all

INSERT INTO "administrators" ("name", "surname", "email", "cpf", "phone1", "phone2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @administrator = Administrator.new(administrator_params)

    respond_to do |format|
      if @administrator.save

UPDATE "administrators" SET "cpf" = ?, "updated_at" = ? WHERE "administrators"."id" = ?  [["cpf", "007"], ["updated_at", "2018-05-14 22:07:04.653106"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @administrator.update(administrator_params)

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_administrator
      @administrator = Administrator.find(params[:id])