app/controllers/facilities_controller.rb

  def index
    @facilities = Facility.all
---
SELECT "facilities".* FROM "facilities"

  def create
    @facility = Facility.new(facility_params)

    respond_to do |format|
      if @facility.save
---
INSERT INTO "facilities" ("latitude", "longitude", "address", "description", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @facility.update(facility_params)
---
UPDATE "facilities" SET "latitude" = ?, "longitude" = ?, "address" = ?, "title" = ?, "updated_at" = ? WHERE "facilities"."id" = ?  [["latitude", -23.4601592], ["longitude", -46.4972457], ["address", "Av Monteiro Lobato Guarulhos brazil"], ["title", "HOTEL MARRIOTT"], ["updated_at", "2018-04-19 03:51:22.917216"], ["id", 1]]

  def destroy
    @facility.destroy
---
DELETE FROM "facilities" WHERE "facilities"."id" = ?  [["id", 3]]

    def set_facility
      @facility = Facility.find(params[:id])
---
SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]