app/controllers/line_items_controller.rb

SELECT  "therapies".* FROM "therapies" WHERE "therapies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-09-10 22:57:01.473395"], ["updated_at", "2018-09-10 22:57:01.473395"]]
INSERT INTO "line_items" ("therapy_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["therapy_id", 1], ["cart_id", 1], ["created_at", "2018-09-10 22:57:01.684301"], ["updated_at", "2018-09-10 22:57:01.684301"]]
---
  def create
    therapy = Therapy.find(params[:therapy_id])
    @line_item = @cart.line_items.build(therapy: therapy)
    #@line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save