app/controllers/pages_controller.rb

SELECT "facilities".* FROM "facilities"
---
  def home

  	@facilities = Facility.all