app/controllers/therapies_controller.rb

SELECT  "therapies".* FROM "therapies" ORDER BY "therapies"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @therapies = Therapy.all