app/controllers/therapies_controller.rb

  def index
    @therapies = Therapy.all.page(params['page']).per(5)
---
SELECT "therapies".* FROM "therapies"
SELECT COUNT(*) FROM "therapies"

  def create
    @therapy = Therapy.new(therapy_params)

    respond_to do |format|
      if @therapy.save
---
INSERT INTO "therapies" ("name", "description", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Massagem"], ["description", "massagem"], ["value", 100.0], ["created_at", "2018-05-15 00:16:14.248050"], ["updated_at", "2018-05-15 00:16:14.248050"]]

    def set_therapy
      @therapy = Therapy.find(params[:id])
---
SELECT  "therapies".* FROM "therapies" WHERE "therapies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]