app/controllers/therapists_controller.rb

SELECT "therapists".* FROM "therapists"
---
  def index
    @therapists = Therapist.all

INSERT INTO "therapists" ("name", "surname", "email", "cpf", "phone1", "phone2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @therapist = Therapist.new(therapist_params)

    respond_to do |format|
      if @therapist.save

SELECT  "therapists".* FROM "therapists" WHERE "therapists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_therapist
      @therapist = Therapist.find(params[:id])